# CannotCutInstanceOutGen Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CutFailures..::..CannotCutInstanceOutGen Property
BuiltInFailures..::..CutFailures Class See Also
---
Can't cut instance(s) of [Symbol] out of its host.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCutInstanceOutGen { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCutInstanceOutGen As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCutInstanceOutGen {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CutFailures Class
Autodesk.Revit.DB Namespace